---
kind: property
id: P:Autodesk.Revit.DB.CurveElement.CurveElementType
source: html/0d8763e7-6d5b-bdb9-c4a7-d19c63f53dc9.htm
---
# Autodesk.Revit.DB.CurveElement.CurveElementType Property

Type of the curve element.

## Syntax (C#)
```csharp
public CurveElementType CurveElementType { get; }
```